{"pageProps":{"jobInfo":[{"OwnerName":"Kapil","CompanyName":"PwC Singapore","Id":39,"OwnerId":65,"CompanyId":42,"JobTitle":"Senior Consultant-SAP Ariba","NoOfOpenings":2,"MinExp":"8","MaxExp":"12","SalaryType":"Monthly","Currency":"SGD","Jobdescription":"<p><strong style=\"color: rgb(52, 53, 65);\">Job Description &amp; Summary</strong></p><p>A career within digital transformation, SAP Consulting services, will provide you with the opportunity to help our clients maximize the value of their SAP investment with offerings that address sales, finance, supply chain, engineering, and human capital. We provide comprehensive consulting, system integration and implementation services across multiple SAP applications, products and technologies. Simply put, we focus on delivering business-led, technology-enabled change for our clients including industry-specific enterprise resource planning and the latest in mobile, analytics and cloud solutions.</p><p><span style=\"color: var(--tw-prose-bold);\">Job Description:</span></p><p>You'll work as part of a team of problem solvers, helping to solve complex business issues from strategy to execution. Professional skills and responsibilities for this management level include but are not limited to:</p><ul><li>Proactive involvement in the implementation of SAP Ariba.</li><li>Conduct business needs analysis and identify key business challenges with the client teams and key stakeholders.</li><li>Identify improvement opportunities to achieve clients’ desired business outcomes.</li><li>Define ‘To-Be’ stage of processes, solution application requirement, and performance measurements.</li><li>Co-develop deployment/enablement strategy, roadmap, and plan to achieve the ‘To-Be’ stage effectively.</li><li>Conduct deployment activities and measure achievement of desired outcomes.</li><li>Lead change for large scale multi-site Ariba Implementation and other related transformational change efforts, including but not limited to efficiency and effectiveness initiatives; organizational restructurings; organizational capabilities development.</li><li>Support and pursuits team with gaining access to tenders, build proposals, win work and deliver projects.</li><li>Act to resolve issues which prevent the team from working effectively.</li><li>Coach others, recognize their strengths, and encourage them to take ownership of their personal development.</li><li>Analyze complex ideas or proposals and build a range of meaningful recommendations.</li><li>Use multiple sources of information including broader stakeholder views to develop solutions and recommendations.</li><li>Address sub-standard work or work that does not meet the firm's/client's expectations.</li><li>Use data and insights to inform conclusions and support decision-making.</li><li>Develop a point of view on key global trends and how they impact clients.</li><li>Manage a variety of viewpoints to build consensus and create positive outcomes for all parties.</li><li>Simplify complex messages, highlighting and summarizing key points.</li><li>Uphold the firm's code of ethics and business conduct.</li></ul><p><span style=\"color: var(--tw-prose-bold);\">Preferred Skills:</span></p><p><span style=\"color: var(--tw-prose-bold);\">Roles/Responsibilities:</span></p><ul><li>Involvement in planning and executing SAP Ariba Implementation / Rollout / Upgrade / Development / Support activities in Ariba Upstream or Downstream modules.</li><li>Ability to configure SAP Ariba Upstream or Downstream conforming to the Client's standards &amp; requirements and integrate it with SAP Materials Management module or other non-SAP ERP systems.</li><li>Secondary skill includes Ariba Cloud Integration Gateway and Ariba Network Integration.</li><li>Strong capability in business process, configuration, functional specification development, custom object unit test and system integration testing.</li></ul><p><span style=\"color: var(--tw-prose-bold);\">Skills/Experience Requirements:</span></p><ul><li>Sound understanding of Source to Pay process and be able to provide an optimum solution utilizing processes available in SAP Ariba.</li><li>Exposure to ASAP implementation methodologies or any Accelerated methodologies for quick wins.</li><li>Know-how in design &amp; blueprinting, configuration, functional Specification, unit testing, integration testing, user acceptance test, authorization, data migration and cutover.</li></ul><p><span style=\"color: var(--tw-prose-bold);\">Prerequisite:</span></p><ul><li>8+ years of experience in SAP Ariba modules with 4-6 full cycle implementation experience of mid to high complexity.</li><li>Excellent in client-facing interactions, leading &amp; driving client workshop, design &amp; blueprinting, configuration, system build, training and cutover.</li><li>Team lead experience, having led a team of SAP Ariba consultants.</li></ul><p><br></p>","MinSalary":"7,000","MaxSalary":"10,000","Qualification":"Bachelor Degree","Specialization":"Computer Science","City":"Singapore","Locality":"Singapore","State":"","Country":"Singapore","Address":"","JobStatus":"Open","created_at":"2023-09-18T07:57:33.000Z","updated_at":"2023-09-18T07:57:33.000Z"}]},"__N_SSG":true}