{"pageProps":{"jobInfo":[{"OwnerName":"Kapil","CompanyName":"SAS Institute Pte Ltd","Id":36,"OwnerId":65,"CompanyId":39,"JobTitle":"Salesforce  Developer","NoOfOpenings":2,"MinExp":"5","MaxExp":"8","SalaryType":"Monthly","Currency":"SGD","Jobdescription":"<h3><span style=\"color: var(--tw-prose-bold);\">Job Description: Salesforce Developer</span></h3><p><span style=\"color: var(--tw-prose-bold);\">About Us:</span></p><p>We are seeking a Salesforce Developer to join our dynamic team. As a Salesforce Developer, you will play a crucial role in the analysis, design, development, implementation, testing, and maintenance of applications, data, and integrations. Your expertise and collaboration will ensure integrity and consistency across our ecosystem.</p><p><span style=\"color: var(--tw-prose-bold);\">Responsibilities:</span></p><ul><li>Analyze, design, develop, implement, test, and maintain applications, data, and integrations.</li><li>Actively engage with other developers and architects to ensure integrity and consistency across the ecosystem.</li><li>Utilize Software Development Lifecycle phases to deliver high-quality applications, incorporating current best practices and methodologies (e.g., continuous integration and deployment, agile/iterative development, test-driven development).</li><li>Adhere to standards and methodologies in project delivery, security, data privacy, integrations, architecture, development (including testing, documentation, and deployment), and automation.</li><li>Stay updated on new technologies, trends, architectures, and implementation techniques related to applications, integrations, and data delivery.</li><li>Participate in business, technical, and design discussions with team members and customers.</li><li>Deliver prioritized technology efforts while meeting expectations for schedule, scope, and quality.</li><li>Effectively identify, manage, mitigate, and escalate risks to appropriate levels of management.</li><li>Perform other duties as assigned.</li></ul><p><span style=\"color: var(--tw-prose-bold);\">Required Qualifications:</span></p><ul><li>Bachelor's degree in Computer Science, Mathematics, Statistics, or a related field.</li><li>Five years of programming experience in an applications development or consulting environment, including two years of experience developing data models in an enterprise environment.</li><li>Familiarity with one or more data modeling tools.</li><li>Salesforce certifications are highly encouraged.</li></ul><p><span style=\"color: var(--tw-prose-bold);\">Preferred Experience:</span></p><ul><li>Experience with tools such as Salesforce, CPQ, Mulesoft, Experience Cloud, Docusign, Netsuite, and/or Magento.</li></ul><p>If you are passionate about Salesforce development, possess the required qualifications, and are eager to contribute to impactful projects, we encourage you to apply for this position. Join us and make a difference in the world of Salesforce development!</p>","MinSalary":"5000","MaxSalary":"8000","Qualification":"Bachelor Degree In Computer Science Or Any Relevant Degree","Specialization":"Computer Science","City":"Singapore","Locality":"Singapore","State":"Singapore","Country":"Singapore","Address":"","JobStatus":"Open","created_at":"2023-09-11T05:12:04.000Z","updated_at":"2023-09-11T05:12:04.000Z"}]},"__N_SSG":true}