{"pageProps":{"jobInfo":[{"OwnerName":"Kapil","CompanyName":"PwC Malaysia","Id":33,"OwnerId":65,"CompanyId":33,"JobTitle":"Senior SAP BTP CAPM Developer","NoOfOpenings":2,"MinExp":"8","MaxExp":"12","SalaryType":"Monthly","Currency":"MYR","Jobdescription":"<p>Job Opportunity: Senior SAP BTP CAPM Developer<br><br>Company: InfoDrive Solutions  <br>Location: Kuala Lumpur, Malaysia/ Singapore<br>Experience: 8+ Years  <br><br>About Us:</p><p>InfoDrive Solutions is a dynamic and innovative technology company operating in Singapore, Malaysia, and the India. We are on the lookout for a highly skilled and experienced Senior SAP BTP CAPM Developer to join our team in Kuala Lumpur, Malaysia and Singapore.<br><br>Job Title: SAP Business Technology Platform CAPM Cloud Application Programming Model&nbsp; Developer<br><br>Key Responsibilities:</p><p><br>- Leverage a minimum of 8 years of progressive experience in cloud application development, specializing in SAP Business Technology Platform (BTP) with a strong focus on the Cloud Application Programming Model (CAPM).<br>- Lead and contribute to at least 2 end-to-end full lifecycle implementation projects, demonstrating expertise in designing and delivering successful solutions.<br>- Architect and implement hybrid cloud solutions by effectively integrating on-premises and cloud-based systems, ensuring seamless performance and connectivity.<br>- Utilize proficiency in SAP BTP services, CAPM, and related technologies like SAP Fiori, SAP HANA, and SAP Cloud Platform to drive innovation and efficiency.<br>- Apply a solid understanding of software development best practices, design patterns, and coding standards to create high-quality and maintainable applications.<br>- Exhibit strong problem-solving skills, diagnosing complex technical issues, and optimizing application performance for superior user experience.<br>- Collaborate effectively within a diverse and multicultural environment, showcasing excellent communication and interpersonal skills.<br><br>Qualifications:</p><p><br>- A minimum of 8 years' experience in developing cloud applications using SAP Business Technology Platform, with a significant focus on CAPM.<br>- Proven track record of contributing to a minimum of 2 end-to-end full lifecycle implementation projects.<br>- Expertise in architecting and implementing hybrid cloud solutions, integrating on-premises and cloud systems.<br>- Proficiency in SAP BTP services, CAPM, and associated technologies (SAP Fiori, SAP HANA, SAP Cloud Platform).<br>- Thorough understanding of software development best practices, design patterns, and coding standards.<br>- Exceptional problem-solving abilities, capable of resolving intricate technical challenges and optimizing application performance.<br>- Excellent communication and interpersonal skills, fostering effective teamwork across cultures.<br>- Prior experience in leadership or mentoring roles is advantageous.<br>- SAP certification(s) related to BTP, CAPM, or cloud development is a plus.<br>- Bachelor's or Master's degree in Computer Science, Engineering, Information Technology, or related field.<br><br>If you're ready to be part of a dynamic team that thrives on innovation and excellence, please submit your application with a detailed CV and cover letter to [email address]. Join us in shaping the future of technology at InfoDrive Solutions.<br><br><br>Note: Only shortlisted candidates will be contacted for further evaluation.<br></p>","MinSalary":"15,000","MaxSalary":"20,000","Qualification":"Bachelor Degree In Computer Science","Specialization":"Computer Science","City":"Kuala Lumpur, Malaysia/ Singapore","Locality":"Kuala Lumpur/ Singapore","State":"Kuala Lumpur/ Singapore","Country":"Malaysia/ Singapore","Address":"#32-07, Q Sentral, 2a, Jalan Stesen Sentral 2\nKuala Lumpur Sentral,","JobStatus":"Open","created_at":"2023-08-21T06:48:35.000Z","updated_at":"2023-08-21T06:48:35.000Z"}]},"__N_SSG":true}