{"pageProps":{"jobInfo":[{"OwnerName":"shashank","CompanyName":"Pixel True","Id":54,"OwnerId":30,"CompanyId":53,"JobTitle":"Salesforce Developers","NoOfOpenings":1,"MinExp":"4","MaxExp":"6","SalaryType":"monthly","Currency":"INR","Jobdescription":"<p>Position: Senior Salesforce Developer</p><p><br></p><p>&nbsp;</p><p><br></p><p>Overview: As the Senior Salesforce Developer, you will have a unique opportunity to not only spend time doing what you love but also flex up to take on architecture responsibilities as part of your growth and development career journey. Using industry best practices your career here can extend beyond the development and implementation of solutions that improve systems, to trying your hand at successfully architecting strategies within and integrating with Salesforce.com. You will play an active role in new Salesforce.com implementations and rollouts while collaborating across the team. Bottom line, if independently developing and implementing technology solutions for multiple projects with a dynamic team is your vibe, then this is the perfect opportunity for you.</p><p><br></p><p>&nbsp;Responsibilities:</p><p><br></p><ul><li>Designing, developing, and integrating software solutions on Salesforce.com.</li><li>Design and/or implement state-of-the-art, efficient, and cost-effective solutions that can be reused by other global or local business areas.</li><li>Ability to support the full application life cycle – architect, design, development, testing, and deployment.</li><li>Create processes, technical system diagrams, and data maps for applications.</li><li>Support key users and troubleshoot issues to resolve them in a timely manner.</li><li>Collaborate with other developers to build maintainable, testable, and efficient systems</li><li>Communicate with project teams regarding status, technical issues, and creative solutions.</li><li>Continue to grow as a developer, staying well-informed about best practices and new functionality on the Force.com platform.</li><li>Actively participate in design and sprint planning sessions, offering relevant solutions and input.</li></ul><p><br></p><p>Qualifications:</p><p><br></p><ul><li>Bachelor’s degree in Computer Science, Information Technology, or equivalent experience.</li><li>Minimum of 4 years of experience as a Salesforce Developer.</li><li>Strong knowledge of the Salesforce platform and development tools, including Apex, Visualforce, and Lightning.</li><li>Salesforce Administrator and Platform Developer I Certifications.</li><li>Familiarity with Agile development methodologies.</li><li>Excellent problem-solving skills and the ability to quickly adapt to new technologies and tools.</li><li>Experience analyzing Salesforce release features for potential impact on production functionality.</li><li>Proficiency with SOAP and REST APIs.</li><li>Preferred: SAP and Salesforce integration experience.</li></ul>","MinSalary":"100000","MaxSalary":"130000","Qualification":"Bachelor’s degree in Computer Science, Information Technology, or equivalent experience. ","Specialization":"Strong knowledge of the Salesforce platform and development tools, including Apex, Visualforce, and Lightning.\nSalesforce Administrator and Platform Developer I Certifications.\nFamiliarity with Agile development methodologies.\nExcellent problem-solving skills and the ability to quickly adapt to new technologies and tools.\nExperience analyzing Salesforce release features for potential impact on production functionality.\nProficiency with SOAP and REST APIs.\nPreferred: SAP and Salesforce integration experience.","City":"India","Locality":"India","State":"India","Country":"India","Address":"India","JobStatus":"Open","created_at":"2023-10-19T08:42:23.000Z","updated_at":"2023-10-19T08:42:23.000Z"}]},"__N_SSG":true}