{"pageProps":{"jobInfo":[{"CompanyName":"Evantage Solutions Sdn Bhd","Id":38,"OwnerId":65,"CompanyId":41,"JobTitle":"ReactJS Developer","NoOfOpenings":1,"MinExp":"2","MaxExp":"5","SalaryType":"Monthly","Currency":"MYR","Jobdescription":"<p><strong style=\"color: var(--tw-prose-bold);\">About Us:</strong></p><p>InfoDrive Solutions is a company seeking passionate and talented individuals to join our dynamic development teams. If you're enthusiastic about cutting-edge web technologies and aspire to contribute to the creation of interactive web applications, we invite you to be a part of our team.</p><h3><span style=\"color: var(--tw-prose-bold);\">Job Responsibilities:</span></h3><p>As a ReactJS Developer at InfoDrive Solutions, you will have the opportunity to:</p><ul><li>Design, implement, develop, test, deploy, and maintain web applications.</li><li>Play a crucial role in shaping the vision and design of modern web applications by staying up-to-date with the latest web technologies.</li><li>Actively participate in all phases of the software development process.</li><li>Analyze and resolve technical and application problems to ensure smooth functionality.</li><li>Engage in the full software development life cycle, from conception to deployment.</li><li>Collaborate in analyzing requirements and make recommendations for system development approaches.</li><li>Optimize applications for maximum speed and scalability.</li><li>Ensure the technical feasibility of UI/UX designs.</li><li>Handle ad-hoc tasks assigned by your immediate superior from time to time.</li></ul><p><span style=\"color: var(--tw-prose-bold);\">Job Requirements:</span></p><p>To excel in this role, you should possess the following qualifications and skills:</p><ul><li>A minimum of 2 years of experience with a strong background in frontend frameworks (ReactJS, AngularJS, or VueJS).</li><li>A deep understanding of React.js and its core principles.</li><li>Proficiency in HTML5, CSS, JavaScript, Bootstrap, jQuery, and Ajax.</li><li>Familiarity with common data interchange formats like JSON and XML.</li><li>Knowledge of interacting with RESTful APIs and data formats such as JSON and XML.</li><li>Strong logical and creative thinking abilities.</li><li>Familiarity with leading JavaScript libraries and frameworks, including AngularJS, ReactJS, BackboneJS, etc.</li><li>Proficiency in using code versioning tools such as SVN, GitHub, BitBucket, etc.</li></ul><p>If you are passionate about frontend development, eager to contribute your skills to exciting projects, and want to be part of a forward-thinking team, we encourage you to apply for this position. Join InfoDrive Solutions, where innovation meets opportunity, and help us build the next generation of web applications. Apply today to make a difference in the world of web development!</p>","MinSalary":"3500","MaxSalary":"6500","Qualification":"Bachelor Degree","Specialization":"Computer Science","City":"Kuala Lumpur","Locality":"Shah Alam","State":"Kuala Lumpur","Country":"Malaysia","Address":"E-8-04, The Gamuda Biz Suite No, 12, Jalan Anggerik Vanilla 31/99, Kota Kemuning, 40460 Shah Alam, Selangor","JobStatus":"Open","created_at":"2023-09-18T07:48:04.000Z","updated_at":"2023-09-18T07:48:04.000Z"}]},"__N_SSG":true}