{"pageProps":{"jobInfo":[{"CompanyName":"PwC Malaysia","Id":40,"OwnerId":65,"CompanyId":33,"JobTitle":"Senior Consultant-SAP Project System","NoOfOpenings":1,"MinExp":"8","MaxExp":"12","SalaryType":"Monthly","Currency":"MYR","Jobdescription":"<p><strong>Job Description: Senior Consultant SAP PS Consultant</strong></p><p><strong style=\"color: var(--tw-prose-bold);\">Company:</strong><strong> InfoDrive Solutions, Malaysia</strong></p><p><strong style=\"color: var(--tw-prose-bold);\">Position:</strong><strong> Senior Consultant SAP PS Consultant</strong></p><p><strong style=\"color: var(--tw-prose-bold);\">Location:</strong><strong> Johor Bahru, Malaysia</strong></p><p><span style=\"color: var(--tw-prose-bold);\">Requirements:</span></p><ul><li>Minimum of 8 years of experience in SAP, with a focus on specified functions.</li><li>Proficiency in SAP Project System (PS) is essential, and familiarity with Project Portfolio Management (PPM) is a plus.</li><li>Strong configuration skills in PS structures, including WBS, standard structures, user status profiles, and Master Data.</li><li>Experience in PPM, including portfolio definition, initiative management, financial and capacity planning, resource planning, and integration with other SAP applications (PS, FI, HCM, etc.).</li><li>Thorough understanding of relevant methodologies, business processes, and industry standards.</li><li>Solid knowledge of the integration between Project Systems and Materials Management, Accounts Payable, Accounts Receivable, Asset Management, Finance, and Human Capital Management.</li><li>Proficient in functional requirement gathering, fit-gap analysis, master data setup, end-user support, and documentation.</li><li>Ability to design and support the development of custom enhancements in PS, PPM, and integration areas.</li><li>Certification in PS/PPM will be a valuable asset.</li><li>Fluent in Bahasa Malay.</li><li>Hands-on experience in at least 5 SAP implementation lifecycles.</li><li>Strong analytical and problem-solving skills.</li><li>Proven experience in leading project implementations and collaborating effectively with offshore teams.</li><li>Excellent interpersonal and organizational skills, with the ability to communicate effectively with both technical and non-technical stakeholders.</li><li>Familiarity with consulting practices and techniques.</li><li>Demonstrated ability and willingness to deliver results within aggressive timelines.</li></ul><p><span style=\"color: var(--tw-prose-bold);\">If you meet these qualifications and are ready to take on an exciting role with InfoDrive Solutions, we encourage you to apply. Join our dynamic team and contribute to the success of our SAP projects in Malaysia.</span></p>","MinSalary":"12,000","MaxSalary":"18,000","Qualification":"Bachler Degree ","Specialization":"Computer Science","City":"Johor Bahru","Locality":"Johor Bahru","State":"Johor","Country":"Malaysia","Address":"","JobStatus":"Open","created_at":"2023-09-20T03:00:08.000Z","updated_at":"2023-09-20T03:00:08.000Z"}]},"__N_SSG":true}