{"pageProps":{"jobInfo":[{"CompanyName":"Cloud Kinetics","Id":43,"OwnerId":64,"CompanyId":46,"JobTitle":"Sr. Kafka and RabbitMQ Admin","NoOfOpenings":1,"MinExp":"8+yrs","MaxExp":"15yrs","SalaryType":"yearly","Currency":"INR","Jobdescription":"<p>5+yrs&nbsp;or more years of demonstrated skill and experience in the design, installation, monitoring, and troubleshooting of messaging infrastructure such as RabbitMQ and Kafka in self-hosted and cloud environments is required</p><p><br></p><p>Rotational Shift - Monthly (Need to cover all 3 shifts)</p><p><br></p><p><br></p><p>Job Description:</p><p>• Standing up and administer On-Prem &amp; cloud-native Kafka clusters.</p><p>• Ability to architect and create a reference architecture for Kafka Implementation standards</p><p>• Provide expertise in Kafka brokers, zookeepers, Kafka connect, schema registry, KSQL, Rest proxy and Kafka Control center.</p><p>• Ensure optimum performance, high availability and stability of solutions</p><p>• Provide expertise and hands on experience working on Kafka connect using schema registry in a very high volume</p><p>• Provide administration and operations of the Kafka platform like provisioning, access lists Kerberos and SSL configurations.</p><p>• Provide expertise and hands on experience working on Kafka connectors such as MQ connectors, Elastic Search connectors, JDBC connectors, File stream connector, JMS source connectors, Tasks, Workers, converters, Transforms.</p><p>• Provide expertise and hands on experience on custom connectors using the Kafka core concepts and API.</p><p>• Involve in design and capacity review meetings to provide suggestions in Kafka usage.</p><p>• Participate in work planning and estimation</p><p>• Ensure optimum performance, high availability and stability of solutions.</p><p>• Create topics, setup redundancy cluster, deploy monitoring tools, alerts and has good knowledge of best practices.</p><p>• Create stubs for producers, consumers and consumer groups for helping onboard applications from different languages/platforms.</p><p>• Use automation tools like provisioning using Docker, Jenkins, and GitLab.</p><p>• Setting up security on Kafka, Monitor, prevent, and troubleshoot security-related issues.</p><p>• Ability to perform data related benchmarking, performance analysis and tuning.</p><p>• Competent working in one or more environments highly integrated with an operating system.</p><p>• Ability to manage tasks independently and take ownership of responsibilities</p><p>• Ability to communicate highly complex technical information clearly and articulately for all levels and audiences.</p><p>• Experience integrating Kafka with other technology products</p><p>• Understanding cloud data streaming technologies (Kafka/ksqlDB, StreamSets, AWS Kinesis, Google Cloud Platform PubSub, etc.), stream processing, event-driven architectures</p><p>• Knowing techniques for data injection and extraction into/from Kafka-based or similar pipelines</p><p>• Working knowledge on Kafka Rest proxy.</p><p>RabbitMQ</p><p>• Experience in Installation, Configuration and Administration of Rabbit MQ on UNIX/Cloud environments.</p><p>• Strong knowledge on Message oriented middleware concepts including different Messaging styles</p><p>• (Asynchronous, pub-sub), Messaging APIs (JMS, STOMP, AMQP, REST).</p><p>• Setting up of exchanges, queues, and virtual hosts.</p><p>• Implementation experience in Clustering, Security and High Availability of Rabbit MQ nodes.</p><p>• Monitoring Alarms of Rabbit MQ.</p><p>• Troubleshooting and migration of Rabbit MQ.</p><p>• Experience and knowledge with Cloud (AWS MQ)</p><p>• Expertise in deploying and maintaining in Cloud environments.</p><p><br></p><p><br></p><p>Good to have:</p><p>• Experience and knowledge of common issues associated with RHEL Servers and strong verbal and written communication skills</p><p>• Good scripting skills (Python, etc.); experience with Java</p><p>• Strong skills in In-memory applications and Data Integration.</p><p>• Working knowledge of Ansible &amp; Automation</p><p>• Knowledge of Kubernetes is plus</p>","MinSalary":"20LPA","MaxSalary":"30LPA","Qualification":"BE/Btech","Specialization":"RabbitMQ and Kafka in self-hosted and cloud environments is required","City":"Remote","Locality":"Remote","State":"India","Country":"India","Address":"India- Remote role","JobStatus":"Open","created_at":"2023-09-22T09:57:12.000Z","updated_at":"2023-09-22T09:57:12.000Z"}]},"__N_SSG":true}