{"pageProps":{"jobInfo":[{"OwnerName":"Nirmala Negi","CompanyName":"Deloitte SEA","Id":66,"OwnerId":64,"CompanyId":57,"JobTitle":"Director for Technology Strategy & Transformation","NoOfOpenings":2,"MinExp":"12","MaxExp":"18","SalaryType":"yearly","Currency":"MYR","Jobdescription":"<p>Job Type: Perm&nbsp;(for Big 4 Consulting Firm)&nbsp;</p><p>Position: Director</p><p>Salary: Attractive</p><p>Location: Malaysia/Indonesia</p><p><br></p><p><br></p><p><br></p><p>Minimum 12 years of professional experience in financial and process transformation, enhanced Telco operations model development, and/or strategic sourcing and procurement engagements for TMT clients.&nbsp;Previous consulting experience with a leading or relevant boutique consulting firm known for the strength of its TMT industry coverage.</p><ul><li>Lead from the front, acting as an exemplary role model of integrity for leaders at all levels; promote a strong sense of loyalty and followership as well as to energise others to perform at the highest level</li><li>Build a high-performance culture by cultivating individual and team strengths; drive outstanding service, quality and stakeholder value, often through a mix of large cross-business and/or cross-border teams.</li><li>Anticipate market and competitor trends to develop and deliver bold and innovative solutions that differentiates client from others.</li></ul>","MinSalary":"40kRM","MaxSalary":"50kRM","Qualification":"MBA","Specialization":"•\tPrevious consulting experience with a leading or relevant boutique consulting firm known for the strength of its TMT industry coverage.\n•\tExperience leading the business model design and implementation, with exposure to one or more of the following areas:\no\tDigital product strategy and enablement\no\tInformation and integration\no\tIT strategy blueprint\no\tCloud strategy\no\tOSS/ BSS solution architecture\n","City":"Malaysia","Locality":"Kuala Lumpur","State":"Malaysia","Country":"Malaysia","Address":"Malaysia and Indonesia work Location (Any)","JobStatus":"Open","created_at":"2024-06-24T03:16:09.000Z","updated_at":"2024-06-24T03:16:09.000Z"}]},"__N_SSG":true}