{"pageProps":{"jobInfo":[{"OwnerName":"Priyanka Vinchurkar","CompanyName":"Incapsulate","Id":59,"OwnerId":42,"CompanyId":37,"JobTitle":"Salesforce FSC Developer","NoOfOpenings":3,"MinExp":"4","MaxExp":"8","SalaryType":"monthly","Currency":"INR","Jobdescription":"<p><strong>Position:</strong>&nbsp;Salesforce Financial Service Cloud Developer</p><p><strong>Experience:</strong>&nbsp;5+ Years</p><p><strong>Work Location:</strong>&nbsp;Remote</p><p><strong>Notice Period: Immediate/ 15 days</strong></p><p><strong>&nbsp;</strong></p><p><strong><u>Job Description:</u></strong></p><p>&nbsp;</p><p>We are seeking an experienced <strong>Salesforce FSC Developer</strong> to join our team. The ideal candidate should possess a minimum of 4+ years of Salesforce development experience with a strong focus on <strong>Financial Services Cloud (FSC).</strong> </p><p>&nbsp;</p><p><strong>Responsibilities:</strong></p><ul><li>Develop and customize Salesforce Financial Services Cloud solutions according to business requirements and best practices.</li><li>Collaborate with stakeholders to gather and understand functional requirements and translate them into technical solutions.</li><li>Design, develop, test, and deploy custom applications, features, and integrations on the Salesforce platform.</li><li>Implement Apex classes, triggers, Visualforce pages, and Lightning components to support business processes and enhance user experience.</li><li>Work closely with cross-functional teams to ensure smooth integration of Salesforce FSC with other systems and tools.</li><li>Perform data migration and data manipulation tasks using Apex Data Loader or other appropriate tools.</li><li>Troubleshoot and resolve issues related to Salesforce configuration, customization, and integration.</li><li>Maintain up-to-date documentation of technical designs, configurations, and customizations.</li><li>Keep abreast of the latest Salesforce features, releases, and industry trends to provide recommendations for enhancements.</li><li>Collaborate with QA teams to ensure the quality of the developed solutions through testing and validation.</li><li>Participate in code reviews to ensure code quality, security, and performance.</li><li>Provide technical guidance and mentorship to junior developers, as needed.</li><li>Contribute to the continuous improvement of development processes and best practices.</li></ul><p><strong>&nbsp;</strong></p><p><strong>Qualifications and Skills:</strong></p><ul><li>Bachelor’s degree in Computer Science, Information Technology, or a related field.</li><li>Minimum of 4+ years of hands-on experience in Salesforce development.</li><li>Strong expertise in <strong>Salesforce Financial Services Cloud (FSC)</strong> is essential.</li><li>Proficiency in Salesforce technologies including Visualforce, Apex, S-controls, and Triggers.</li><li>Experience with integration tools and methodologies, REST/SOAP APIs, and web services.</li><li>Proven track record of delivering successful Salesforce projects on time and within scope.</li><li>Excellent problem-solving skills and ability to troubleshoot complex technical issues.</li><li>Effective communication skills, both verbal and written.</li><li><strong>Salesforce Developer (401) or Admin (201)</strong> certification is required.</li><li>Salesforce Platform Developer (PD1) certification is a plus.</li><li>Experience with Lightning components and development is desirable.</li><li>Familiarity with agile development methodologies is preferred.</li><li>Financial industry knowledge is a bonus.</li></ul><p><br></p>","MinSalary":"1200000","MaxSalary":"3000000","Qualification":"Minimum of 4+ years of hands-on experience in Salesforce development.","Specialization":"Strong expertise in Salesforce Financial Services Cloud (FSC) is essential.","City":"Remote","Locality":"","State":"","Country":"India","Address":"","JobStatus":"Open","created_at":"2024-04-08T06:36:26.000Z","updated_at":"2024-04-08T06:36:26.000Z"}]},"__N_SSG":true}